In [6]:
#Creating Databases in MySQL

import mysql.connector
mydb = mysql.connector.connect(host="localhost",  
              user="*****",  password="*******")
print(mydb)
cursor = mydb.cursor()

<mysql.connector.connection_cext.CMySQLConnection object at 0x000002B1C4450850>

In [7]:
cursor.execute('SHOW DATABASES')
for database in cursor:
    print(database)

('abc',)
('business',)
('games2win',)
('grofers',)
('information_schema',)
('krish',)
('mysql',)
('performance_schema',)
('pharm_easy',)
('sales',)
('sys',)

In [8]:
# sql_mode=only_full_group_by

sql= "SET sql_mode=(SELECT REPLACE(@@sql_mode,'ONLY_FULL_GROUP_BY',''))"
cursor.execute(sql)
mydb.commit()

In [9]:
# -selected database

cursor.execute('use pharm_easy')

In [11]:
#Show tables

sql= "show tables"
cursor.execute(sql)

for database in cursor:
    print(database)

('employees',)
('follows',)
('users',)

In [12]:
#0.1 #Q0  Table_users

sql= "select * from users "
cursor.execute(sql)
myresult= cursor.fetchall()

for x in myresult:
  print(x)

In [13]:
#0.1 #Q0  Table_follows

sql= "select * from follows "
cursor.execute(sql)
myresult= cursor.fetchall()

for x in myresult:
  print(x)

In [14]:
#0.1 #Q0  Table_employees

sql= "select * from employees "
cursor.execute(sql)
myresult= cursor.fetchall()

for x in myresult:
  print(x)

('1401', 'D Maiti', '140000', 'Prof', '42')
('1402', 'Amit Sethi', '100000', 'Prof', '39')
('1403', 'Tilak Maiti', '40000', 'Prof', '29')
('1404', 'Krish Nendu', '70000', 'Prof', '27')
('1405', 'Babu', '60000', 'Engineer', '26')
('1406', 'Bablu', '120000', 'Engineer', '56')
('1407', 'Srinjoy', '80000', 'Engineer', '25')
('1408', 'Samu', '80000', 'Engineer', '58')
('1409', 'Narayan', '50000', 'Doct', '68')
('1410', 'Samares', '20000', 'Doct', '35')
('1411', 'Amitosh', '40000', 'Doct', '27')
('1412', 'Anup', '30000', 'Doct', '32')
('1413', 'Tripti', '40000', 'Techer', '35')
('1414', 'Bratati', '37000', 'Techer', '41')
('1415', 'Hedu', '60000', 'Techer', '58')
('1416', 'Moinag', '29000', 'Techer', '29')

In [6]:
#1 #calculate how many users are there in each house .

sql= "select house,count(user_id) as count from users group by house ;"
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('BlackRose', 4)
('G.House', 4)
('A.P.J.Abdulkalam', 4)
('Modi House', 4)

In [7]:
#2 #How many users(show name) follow by each user.

sql= "select a.user_id, concat(a.fstname,' ',a.lstname) as name,count(b.follow) as follow from users as a inner join follows as b on a.user_id=b.user_id group by b.user_id ;"
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('1401', ' Debabrata  Maiti', 8)
('1402', ' Amit  Sethi', 8)
('1403', ' Tilak Maiti', 7)
('1404', ' Krish Bhowmick', 10)
('1405', ' Babu Bhowmick', 9)
('1406', ' Bablu Bhowmick', 7)

In [8]:
#3 #Make a list that connect before 2015, after 2016, between 2014-2018, on 2018 with concate name.

sql= "select a.user_id, concat(a.fstname,' ',a.lstname) as name,count(b.follow) as follow from users as a inner join follows as b on a.user_id=b.user_id where date<'2015-01-01' group by b.user_id "
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

# select a.user_id, concat(a.fstname,' ',a.lstname) as name,count(b.follow) as follow from users as a inner join follows as b on a.user_id=b.user_id where date>'2015-01-01' group by b.user_id ;
# select a.user_id, concat(a.fstname,' ',a.lstname) as name,count(b.follow) as follow from users as a inner join follows as b on a.user_id=b.user_id where date>'2014-01-01' and date<'2018-12-30' group by b.user_id ;
# select a.user_id, concat(a.fstname,' ',a.lstname) as name,count(b.follow) as follow from users as a inner join follows as b on a.user_id=b.user_id where date>='2018-01-01' and date<='2018-12-30' group by b.user_id ;
#

('1401', ' Debabrata  Maiti', 2)
('1402', ' Amit  Sethi', 5)
('1403', ' Tilak Maiti', 4)
('1404', ' Krish Bhowmick', 5)
('1405', ' Babu Bhowmick', 3)
('1406', ' Bablu Bhowmick', 4)

In [9]:
##3.1 #How many users follow by a particular user, who doesnot belong to same house.

sql="select * from (select A.user_id as id,A.fstname as name,A.house,B.user_id,B.follow,B.date from users as A inner join follows as B on A.user_id=B.user_id order by date) as E inner join (select C.user_id as id_B,C.fstname as name_B,C.house as house_B,D.user_id as user_id_B,D.follow as follow_B,D.date as date_B from users as C inner join follows as D on C.user_id=D.follow order by date) as F on E.date=F.date_B where house!=house_B"
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('1401', ' Debabrata', 'BlackRose', '1401', '1405', '2019-05-29', '1405', ' Babu', 'G.House', '1401', '1405', '2019-05-29')
('1401', ' Debabrata', 'BlackRose', '1401', '1407', '2015-03-12', '1407', 'Srinjoy', 'G.House', '1401', '1407', '2015-03-12')
('1401', ' Debabrata', 'BlackRose', '1401', '1409', '2013-08-22', '1409', 'Narayan', 'A.P.J.Abdulkalam', '1401', '1409', '2013-08-22')
('1401', ' Debabrata', 'BlackRose', '1401', '1411', '2017-09-02', '1411', 'Amitosh', 'A.P.J.Abdulkalam', '1401', '1411', '2017-09-02')
('1401', ' Debabrata', 'BlackRose', '1401', '1413', '2017-02-09', '1413', 'Tripti', 'Modi House', '1401', '1413', '2017-02-09')
('1401', ' Debabrata', 'BlackRose', '1401', '1416', '2015-12-26', '1416', 'Moinag', 'Modi House', '1401', '1416', '2015-12-26')
('1402', ' Amit', 'BlackRose', '1402', '1416', '2011-02-06', '1416', 'Moinag', 'Modi House', '1402', '1416', '2011-02-06')
('1402', ' Amit', 'BlackRose', '1402', '1415', '2016-10-16', '1415', 'Anirbam', 'Modi House', '1402', '1415', '2016-10-16')
('1402', ' Amit', 'BlackRose', '1402', '1410', '2013-11-06', '1410', 'Samares', 'A.P.J.Abdulkalam', '1402', '1410', '2013-11-06')
('1402', ' Amit', 'BlackRose', '1402', '1408', '2014-01-09', '1408', 'Somu', 'G.House', '1402', '1408', '2014-01-09')
('1402', ' Amit', 'BlackRose', '1402', '1407', '2013-05-21', '1407', 'Srinjoy', 'G.House', '1402', '1407', '2013-05-21')
('1402', ' Amit', 'BlackRose', '1402', '1406', '2016-08-30', '1406', ' Bablu', 'G.House', '1402', '1406', '2016-08-30')
('1403', ' Tilak', 'BlackRose', '1403', '1416', '2014-05-03', '1416', 'Moinag', 'Modi House', '1403', '1416', '2014-05-03')
('1403', ' Tilak', 'BlackRose', '1403', '1405', '2012-10-05', '1405', ' Babu', 'G.House', '1403', '1405', '2012-10-05')
('1403', ' Tilak', 'BlackRose', '1403', '1409', '2010-12-27', '1409', 'Narayan', 'A.P.J.Abdulkalam', '1403', '1409', '2010-12-27')
('1403', ' Tilak', 'BlackRose', '1403', '1414', '2017-04-17', '1414', 'Bratati', 'Modi House', '1403', '1414', '2017-04-17')
('1404', ' Krish', 'BlackRose', '1404', '1410', '2019-01-07', '1410', 'Samares', 'A.P.J.Abdulkalam', '1404', '1410', '2019-01-07')
('1404', ' Krish', 'BlackRose', '1404', '1411', '2015-05-15', '1411', 'Amitosh', 'A.P.J.Abdulkalam', '1404', '1411', '2015-05-15')
('1404', ' Krish', 'BlackRose', '1404', '1413', '2017-03-22', '1413', 'Tripti', 'Modi House', '1404', '1413', '2017-03-22')
('1404', ' Krish', 'BlackRose', '1404', '1414', '2016-07-24', '1414', 'Bratati', 'Modi House', '1404', '1414', '2016-07-24')
('1404', ' Krish', 'BlackRose', '1404', '1415', '2013-09-26', '1415', 'Anirbam', 'Modi House', '1404', '1415', '2013-09-26')
('1404', ' Krish', 'BlackRose', '1404', '1407', '2018-03-06', '1407', 'Srinjoy', 'G.House', '1404', '1407', '2018-03-06')
('1404', ' Krish', 'BlackRose', '1404', '1405', '2011-05-16', '1405', ' Babu', 'G.House', '1404', '1405', '2011-05-16')
('1405', ' Babu', 'G.House', '1405', '1404', '2013-07-09', '1404', ' Krish', 'BlackRose', '1405', '1404', '2013-07-09')
('1405', ' Babu', 'G.House', '1405', '1402', '2017-03-29', '1402', ' Amit', 'BlackRose', '1405', '1402', '2017-03-29')
('1405', ' Babu', 'G.House', '1405', '1401', '2014-10-21', '1401', ' Debabrata', 'BlackRose', '1405', '1401', '2014-10-21')
('1405', ' Babu', 'G.House', '1405', '1410', '2016-11-01', '1410', 'Samares', 'A.P.J.Abdulkalam', '1405', '1410', '2016-11-01')
('1405', ' Babu', 'G.House', '1405', '1411', '2018-10-28', '1411', 'Amitosh', 'A.P.J.Abdulkalam', '1405', '1411', '2018-10-28')
('1405', ' Babu', 'G.House', '1405', '1412', '2018-07-08', '1412', 'Anup', 'A.P.J.Abdulkalam', '1405', '1412', '2018-07-08')
('1405', ' Babu', 'G.House', '1405', '1415', '2015-05-05', '1415', 'Anirbam', 'Modi House', '1405', '1415', '2015-05-05')
('1406', ' Bablu', 'G.House', '1406', '1416', '2014-09-04', '1416', 'Moinag', 'Modi House', '1406', '1416', '2014-09-04')
('1406', ' Bablu', 'G.House', '1406', '1413', '2019-03-24', '1413', 'Tripti', 'Modi House', '1406', '1413', '2019-03-24')
('1406', ' Bablu', 'G.House', '1406', '1410', '2019-08-14', '1410', 'Samares', 'A.P.J.Abdulkalam', '1406', '1410', '2019-08-14')
('1406', ' Bablu', 'G.House', '1406', '1403', '2016-07-07', '1403', ' Tilak', 'BlackRose', '1406', '1403', '2016-07-07')
('1406', ' Bablu', 'G.House', '1406', '1402', '2013-09-18', '1402', ' Amit', 'BlackRose', '1406', '1402', '2013-09-18')

In [10]:
##3.1 #How many users follow by a particular user, who doesnot belong to same house.

sql= "select name,count(name) as count from (select * from (select A.user_id as id,A.fstname as name,A.house,B.user_id,B.follow,B.date from users as A inner join follows as B on A.user_id=B.user_id order by date) as E inner join (select C.user_id as id_B,C.fstname as name_B,C.house as house_B,D.user_id as user_id_B,D.follow as follow_B,D.date as date_B from users as C inner join follows as D on C.user_id=D.follow order by date) as F on E.date=F.date_B where house!=house_B) SUB group by name"
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

(' Debabrata', 6)
(' Amit', 6)
(' Tilak', 4)
(' Krish', 7)
(' Babu', 7)
(' Bablu', 5)

In [11]:
#4 #Start ans finish with k

sql= "select user_id, concat(fstname,' ',lstname) as name,house from users where lstname like '%k' ;"
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('1404', ' Krish Bhowmick', 'BlackRose')
('1405', ' Babu Bhowmick', 'G.House')
('1406', ' Bablu Bhowmick', 'G.House')
('1409', 'Narayan Bhowmick', 'A.P.J.Abdulkalam')
('1413', 'Tripti Bhowmick', 'Modi House')
('1416', 'Moinag QuestionBank', 'Modi House')

In [12]:
#5 #tell me the details of the person, who age is maximum

sql= "select * from employees order by age desc limit 1"
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

#;

('1409', 'Narayan', '50000', 'Doct', '68')

In [13]:
#5.1 #tell me the details of the person, who age is maximum

sql= "select * from employees where age= (select max(age) from employees)"
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('1409', 'Narayan', '50000', 'Doct', '68')

In [14]:
#6 #Catagory of age where (<30=1) (30-40=2) (>40=3)

sql= "select id,name,salary,dept,age, CASE WHEN age<30 THEN 'A' WHEN age BETWEEN 30 AND 45 THEN 'AA' WHEN age>45 THEN 'AAA' END AS category from employees order by category;"
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('1403', 'Tilak Maiti', '40000', 'Prof', '29', 'A')
('1404', 'Krish Nendu', '70000', 'Prof', '27', 'A')
('1405', 'Babu', '60000', 'Engineer', '26', 'A')
('1407', 'Srinjoy', '80000', 'Engineer', '25', 'A')
('1411', 'Amitosh', '40000', 'Doct', '27', 'A')
('1416', 'Moinag', '29000', 'Techer', '29', 'A')
('1401', 'D Maiti', '140000', 'Prof', '42', 'AA')
('1402', 'Amit Sethi', '100000', 'Prof', '39', 'AA')
('1410', 'Samares', '20000', 'Doct', '35', 'AA')
('1412', 'Anup', '30000', 'Doct', '32', 'AA')
('1413', 'Tripti', '40000', 'Techer', '35', 'AA')
('1414', 'Bratati', '37000', 'Techer', '41', 'AA')
('1406', 'Bablu', '120000', 'Engineer', '56', 'AAA')
('1408', 'Samu', '80000', 'Engineer', '58', 'AAA')
('1409', 'Narayan', '50000', 'Doct', '68', 'AAA')
('1415', 'Hedu', '60000', 'Techer', '58', 'AAA')

In [20]:
#7 #Highest age in each dept (Wrong)

sql= "select * from employees where age= any(select max(age) from employees group by dept)"
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('1401', 'D Maiti', '140000', 'Prof', '42')
('1408', 'Samu', '80000', 'Engineer', '58')
('1409', 'Narayan', '50000', 'Doct', '68')
('1415', 'Hedu', '60000', 'Techer', '58')

In [16]:
#7.1 #Highest age in each dept using window function

sql= "select * from (select ROW_NUMBER() OVER(PARTITION BY dept order by age desc) as rnk, id,name,salary,dept,age from employees)SUB where rnk<=1"
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

(1, '1409', 'Narayan', '50000', 'Doct', '68')
(1, '1408', 'Samu', '80000', 'Engineer', '58')
(1, '1401', 'D Maiti', '140000', 'Prof', '42')
(1, '1415', 'Hedu', '60000', 'Techer', '58')

In [17]:
#8 # How many are copyed/repetative and what are those values.

sql= "select a.id,a.name,a.salary,a.dept,a.age from employees as a inner join (select age, count(age) from employees group by age having count(age)>1) as b on a.age=b.age order by age"
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('1404', 'Krish Nendu', '70000', 'Prof', '27')
('1411', 'Amitosh', '40000', 'Doct', '27')
('1403', 'Tilak Maiti', '40000', 'Prof', '29')
('1416', 'Moinag', '29000', 'Techer', '29')
('1410', 'Samares', '20000', 'Doct', '35')
('1413', 'Tripti', '40000', 'Techer', '35')
('1408', 'Samu', '80000', 'Engineer', '58')
('1415', 'Hedu', '60000', 'Techer', '58')

In [18]:
# LEAD
#9 #Tell me the time intervel one user connect with another integer-

sql= "select user_id,follow,date,LastDay,DATEDIFF(LastDay,date) as Diff from (select user_id,follow,date, LEAD(date,1,'2020-03-04') OVER(PARTITION BY user_id order by user_id,date) AS LastDay from follows) SUB"
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('1401', '1409', '2013-08-22', '2014-11-10', 445)
('1401', '1402', '2014-11-10', '2015-03-12', 122)
('1401', '1407', '2015-03-12', '2015-12-26', 289)
('1401', '1416', '2015-12-26', '2016-01-19', 24)
('1401', '1403', '2016-01-19', '2017-02-09', 387)
('1401', '1413', '2017-02-09', '2017-09-02', 205)
('1401', '1411', '2017-09-02', '2019-05-29', 634)
('1401', '1405', '2019-05-29', '2020-03-04', 280)
('1402', '1416', '2011-02-06', '2012-12-20', 683)
('1402', '1401', '2012-12-20', '2013-05-21', 152)
('1402', '1407', '2013-05-21', '2013-11-06', 169)
('1402', '1410', '2013-11-06', '2014-01-09', 64)
('1402', '1408', '2014-01-09', '2015-02-10', 397)
('1402', '1403', '2015-02-10', '2016-08-30', 567)
('1402', '1406', '2016-08-30', '2016-10-16', 47)
('1402', '1415', '2016-10-16', '2020-03-04', 1235)
('1403', '1409', '2010-12-27', '2012-10-05', 648)
('1403', '1405', '2012-10-05', '2013-08-13', 312)
('1403', '1402', '2013-08-13', '2014-05-03', 263)
('1403', '1416', '2014-05-03', '2017-04-17', 1080)
('1403', '1414', '2017-04-17', '2018-02-23', 312)
('1403', '1401', '2018-02-23', '2018-11-25', 275)
('1403', '1404', '2018-11-25', '2020-03-04', 465)
('1404', '1402', '2010-03-01', '2010-04-10', 40)
('1404', '1401', '2010-04-10', '2010-07-11', 92)
('1404', '1403', '2010-07-11', '2011-05-16', 309)
('1404', '1405', '2011-05-16', '2013-09-26', 864)
('1404', '1415', '2013-09-26', '2015-05-15', 596)
('1404', '1411', '2015-05-15', '2016-07-24', 436)
('1404', '1414', '2016-07-24', '2017-03-22', 241)
('1404', '1413', '2017-03-22', '2018-03-06', 349)
('1404', '1407', '2018-03-06', '2019-01-07', 307)
('1404', '1410', '2019-01-07', '2020-03-04', 422)
('1405', '1408', '2013-04-20', '2013-07-09', 80)
('1405', '1404', '2013-07-09', '2014-10-21', 469)
('1405', '1401', '2014-10-21', '2015-05-05', 196)
('1405', '1415', '2015-05-05', '2016-11-01', 546)
('1405', '1410', '2016-11-01', '2017-03-02', 121)
('1405', '1406', '2017-03-02', '2017-03-29', 27)
('1405', '1402', '2017-03-29', '2018-07-08', 466)
('1405', '1412', '2018-07-08', '2018-10-28', 112)
('1405', '1411', '2018-10-28', '2020-03-04', 493)
('1406', '1407', '2012-08-17', '2013-03-27', 222)
('1406', '1405', '2013-03-27', '2013-09-18', 175)
('1406', '1402', '2013-09-18', '2014-09-04', 351)
('1406', '1416', '2014-09-04', '2016-07-07', 672)
('1406', '1403', '2016-07-07', '2019-03-24', 990)
('1406', '1413', '2019-03-24', '2019-08-14', 143)
('1406', '1410', '2019-08-14', '2020-03-04', 203)

In [19]:
#
#Cumulative age department wise

sql= "select id,name,dept,age, sum(age) over(partition by dept order by age) as cum from employees"
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('1411', 'Amitosh', 'Doct', '27', 27.0)
('1412', 'Anup', 'Doct', '32', 59.0)
('1410', 'Samares', 'Doct', '35', 94.0)
('1409', 'Narayan', 'Doct', '68', 162.0)
('1407', 'Srinjoy', 'Engineer', '25', 25.0)
('1405', 'Babu', 'Engineer', '26', 51.0)
('1406', 'Bablu', 'Engineer', '56', 107.0)
('1408', 'Samu', 'Engineer', '58', 165.0)
('1404', 'Krish Nendu', 'Prof', '27', 27.0)
('1403', 'Tilak Maiti', 'Prof', '29', 56.0)
('1402', 'Amit Sethi', 'Prof', '39', 95.0)
('1401', 'D Maiti', 'Prof', '42', 137.0)
('1416', 'Moinag', 'Techer', '29', 29.0)
('1413', 'Tripti', 'Techer', '35', 64.0)
('1414', 'Bratati', 'Techer', '41', 105.0)
('1415', 'Hedu', 'Techer', '58', 163.0)